Repository: loloof64/ChessPgnReviserFlutter
Catalog: lib/l10n/app_*.arb
Languages: es, fr

# okButton
source: Ok
es: Validar
fr: Valider

# cancelButton
source: Cancel
es: Anular
fr: Annuler

# yesButton
source: Yes
es: Si
fr: Oui

# noButton
source: No
fr: Non

# gameResultWhiteWin
source: White should win.
es: Los blancos deberían ganar.
fr: Les Blancs devraient gagner.

# gameResultBlackWin
source: Black should win.
es: Los negros deberían ganar.
fr: Les Noirs devraient gagner.

# gameResultDraw
source: It should be draw.
es: Debería ser un empate.
fr: Cela devrait être une partie nulle.

# gameSelectorTitle
source: Game selection
es: Selección de la partida.
fr: Selection de la partie

# gameModePlayerGuessMove
source: You guess the moves
es: Advina los golpes.
fr: Vous devinez les coups

# gameModeComputerPlaysRandomly
source: Computer plays moves randomly
es: La computadora elige los golpes al azar.
fr: L'ordinateur chosit les coups au hasard.

# gameModeUserChooseMove
source: Computer lets you select the moves
es: La computadora le permite elegir los golpes.
fr: L'ordinateur vous laisse choisir les coups

source: Game not in progress
es: No hay partida en progreso
fr: Aucune partie en cours

# whiteMode
source: Whites
es: Blancos
fr: Blancs

# blackMode
source: Blacks
es: Negros
fr: Noirs

# moveChoiceConfirmationTitle
source: Move choice
es: Elección del golpe
fr: Choix du coup

# moveChoiceConfirmationMessage
source: There are several moves available, make your choice :
es: Hay varios golpes disponibles, haga su elección :
fr: Plusieurs coups sont disponibles, faîtes votre choix :

# cancelledNewGameRequest
source: Cancelled new game.
es: Nueva partida cancelada.
fr: Nouvelle partie annulée.

# noMoveInLoadedGame
source: Cannot load the position : no move can be made.
es: No se puede cargar la partida solicitada: ¡no es posible realizar ningún golpe!
fr: Impossible de charger la partie demandée : aucun coup n'est possible !

# couldNotLoadPgn
source: Failed to read pgn content: cancelled new game.
es: Error al leer el archivo PGN : nueva partida cancelada.
fr: Echec de lecture du fichier PGN : nouvelle partie annulée.

# newGameDialogTitle
source: Start new game ?
es: ¿Partida nueva?
fr: Nouvelle partie ?

# newGameDialogMessage
source: Do you want to start a new game and leave the current one ?
es: ¿Quieres salir de la partida actual y empezar una nueva
fr: Voulez-vous quitter la partie en cours et démarrer une nouvelle ?

# stopGameDialogTitle
source: Stop current game ?
es: ¿Detener la partida?
fr: Arrêter la partie ?

# stopGameDialogMessage
source: Do you want to start stop current game ?
es: ¿Estás seguro de que quieres detener la partida?
fr: Souhaitez-vous vraiment arrêter la partie ?

source: Game stopped.
es: Partida terminada.
fr: Partie arrêtée.

# userCongratulationTitle
source: Game finished
es: Partida terminada
fr: Fin de partie

# badMoveTitle
source: Bad move
es: Mal golpe
fr: Mauvais coup

# badMoveMessage
source: Unexpected move {wrongMoveFan} ! Expected one of {expectedMovesFanList}.
es: Golpe inesperado {wrongMoveFan}! Esperando uno de {expectedMovesFanList}.
fr: Coup inattendu {wrongMoveFan} ! Attendant un parmi {expectedMovesFanList}.

# gamePageTitle
source: Game page
es: Página de la partida
fr: Page de jeu

# aboutDialog
source: About
es: A proposito
fr: À propos

# appDescription
source: Load your chess PGN file and try to find moves (from your side).
es: Carga tu archivo PGN e intenta adivinar los golpes (de tu lado).
fr: Chargez votre fichier PGN et essayez de deviner les coups (de vôtre côté).

# creditsSection
source: Credits Using some pictures from flaticon.com: * red_cross : downloaded at https://www.flaticon.com/free-icon/cancel_1168643 and designed by FreePik, * race_flag : downloaded at https://www.flaticon.com/free-icon/racing-flag_1505471 and designed by SmashIcons, * first_item : downloaded at https://www.flaticon.com/free-icon/arrowheads-of-thin-outline-to-the-left_32766 and designed by FreePik, * previous_item : downloaded at https://www.flaticon.com/free-icon/black-triangular-arrowhead-pointing-to-left-direction_45050 and designed by FreePik, * last_item : downloaded at https://www.flaticon.com/free-icon/right-thin-arrowheads_32738 and designed by FreePik, * next_item : downloaded at https://www.flaticon.com/free-icon/right-triangular-arrowhead_44452 and designed by FreePik, * reverse_arrows : downloaded at https://www.flaticon.com/free-icon/arrows_685838 and designed by Good Ware, * stop : downloaded at https://www.flaticon.com/free-icon/stop_827428 and designed by SmashIcons * info : donwloaded at https://www.flaticon.com/free-icon/info_189664 and designed by RoundIcons * sun : downloaded at https://www.flaticon.com/free-icon/sun_869767 and designed by FreePik * night : downloaded at https://www.flaticon.com/free-icon/half-moon_547433 and designed by FreePik Adapted PGN PEG rules at https://github.com/mliebelt/pgn-parser/blob/master/src/pgn-rules.pegjs from project [pgn-parser](https://github.com/mliebelt/pgn-parser/blob/master/src/pgn-rules.pegjs), which is release under Apache License 2.0 (even if some elements have been modified/removed). FreeSerif font downloaded from https://fr.fonts2u.com/free-serif.police
es: Créditos Utilice algunas imágenes de flaticon.com: * red_cross : descargado de https://www.flaticon.com/free-icon/cancel_1168643 y diseñado por FreePik * race_flag : descargado de https://www.flaticon.com/free-icon/racing-flag_1505471 y diseñado por SmashIcons * first_item : descargado de https://www.flaticon.com/free-icon/arrowheads-of-thin-outline-to-the-left_32766 y diseñado por FreePik * previous_item : descargado de https://www.flaticon.com/free-icon/black-triangular-arrowhead-pointing-to-left-direction_45050 y diseñado por FreePik * last_item : descargado de https://www.flaticon.com/free-icon/right-thin-arrowheads_32738 y diseñado por FreePik * next_item : descargado de https://www.flaticon.com/free-icon/right-triangular-arrowhead_44452 y diseñado por FreePik * reverse_arrows : descargado de https://www.flaticon.com/free-icon/arrows_685838 y diseñado por Good Ware * stop : descargado de https://www.flaticon.com/free-icon/stop_827428 y diseñado por SmashIcons * info : descargado de https://www.flaticon.com/free-icon/info_189664 y diseñado por RoundIcons * sun : descargado de https://www.flaticon.com/free-icon/sun_869767 y diseñado por FreePik * night : descargado de https://www.flaticon.com/free-icon/half-moon_547433 y diseñado por FreePik Adaptado a las reglas PEG PGN disponibles en https://github.com/mliebelt/pgn-parser/blob/master/src/pgn-rules.pegjs del proyecto [pgn-parser](https://github.com/mliebelt/pgn-parser/blob/master/src/pgn-rules.pegjs), distribuido bajo la Licencia Apache 2.0 (aunque algunos elementos han sido modificados / eliminados). Tipografía FreeSerif descargado de https://fr.fonts2u.com/free-serif.police
fr: Credits Utilise certaines images de flaticon.com: * red_cross : téléchargée depuis https://www.flaticon.com/free-icon/cancel_1168643 et dessinée par FreePik * race_flag : téléchargée depuis https://www.flaticon.com/free-icon/racing-flag_1505471 et dessinée par SmashIcons * first_item : téléchargée depuis https://www.flaticon.com/free-icon/arrowheads-of-thin-outline-to-the-left_32766 et dessinée par FreePik * previous_item : téléchargée depuis https://www.flaticon.com/free-icon/black-triangular-arrowhead-pointing-to-left-direction_45050 et dessinée par FreePik * last_item : téléchargée depuis https://www.flaticon.com/free-icon/right-thin-arrowheads_32738 et dessinée par FreePik * next_item : téléchargée depuis https://www.flaticon.com/free-icon/right-triangular-arrowhead_44452 et dessinée par FreePik * reverse_arrows : téléchargée depuis https://www.flaticon.com/free-icon/arrows_685838 et dessinée par Good Ware * stop : téléchargée depuis https://www.flaticon.com/free-icon/stop_827428 et dessinée par SmashIcons * info : téléchargée depuis https://www.flaticon.com/free-icon/info_189664 et dessinée par RoundIcons * sun : téléchargée depuis https://www.flaticon.com/free-icon/sun_869767 et dessinée par FreePik * night : téléchargée depuis https://www.flaticon.com/free-icon/half-moon_547433 et dessinée par FreePik Adapté les règles PEG PGN disponibles sur https://github.com/mliebelt/pgn-parser/blob/master/src/pgn-rules.pegjs à partir du projet [pgn-parser](https://github.com/mliebelt/pgn-parser/blob/master/src/pgn-rules.pegjs), distribué sous license Apache License 2.0 (même si certains éléments ont été modifiés/supprimés). Fonte FreeSerif téléchargée depuis https://fr.fonts2u.com/free-serif.police

# sessionOption
source: Session mode
fr: Mode session

# sessionCountLabel
source: Success count per branch
fr: Nombre de succès par branche

# completionTargetParseError
source: Setting count per branch to 3, as given input is invalid.
fr: Le compte par branche est fixé à 3, comme la valeur donnée est incorrecte.

source: Goal per branch
fr: Objectif par branche

# globalOptions
source: Options
es: Opciones

# promotionTitle
source: Promotion
es: Promoción
